__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 299, 299, 3)  0                                            
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 149, 149, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 149, 149, 64) 0           conv1[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 74, 74, 64)   0           activation_1[0][0]               
__________________________________________________________________________________________________
fire2/squeeze (Conv2D)          (None, 74, 74, 16)   1040        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 74, 74, 16)   0           fire2/squeeze[0][0]              
__________________________________________________________________________________________________
fire2/expand1x1 (Conv2D)        (None, 74, 74, 64)   1088        activation_2[0][0]               
__________________________________________________________________________________________________
fire2/expand3x3 (Conv2D)        (None, 74, 74, 64)   9280        activation_2[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 74, 74, 64)   0           fire2/expand1x1[0][0]            
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 74, 74, 64)   0           fire2/expand3x3[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 74, 74, 128)  0           activation_3[0][0]               
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
fire3/squeeze (Conv2D)          (None, 74, 74, 16)   2064        concatenate_1[0][0]              
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 74, 74, 16)   0           fire3/squeeze[0][0]              
__________________________________________________________________________________________________
fire3/expand1x1 (Conv2D)        (None, 74, 74, 64)   1088        activation_5[0][0]               
__________________________________________________________________________________________________
fire3/expand3x3 (Conv2D)        (None, 74, 74, 64)   9280        activation_5[0][0]               
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 74, 74, 64)   0           fire3/expand1x1[0][0]            
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 74, 74, 64)   0           fire3/expand3x3[0][0]            
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 74, 74, 128)  0           activation_6[0][0]               
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 36, 36, 128)  0           concatenate_2[0][0]              
__________________________________________________________________________________________________
fire4/squeeze (Conv2D)          (None, 36, 36, 32)   4128        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 36, 36, 32)   0           fire4/squeeze[0][0]              
__________________________________________________________________________________________________
fire4/expand1x1 (Conv2D)        (None, 36, 36, 128)  4224        activation_8[0][0]               
__________________________________________________________________________________________________
fire4/expand3x3 (Conv2D)        (None, 36, 36, 128)  36992       activation_8[0][0]               
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 36, 36, 128)  0           fire4/expand1x1[0][0]            
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 36, 36, 128)  0           fire4/expand3x3[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 36, 36, 256)  0           activation_9[0][0]               
                                                                 activation_10[0][0]              
__________________________________________________________________________________________________
fire5/squeeze (Conv2D)          (None, 36, 36, 32)   8224        concatenate_3[0][0]              
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 36, 36, 32)   0           fire5/squeeze[0][0]              
__________________________________________________________________________________________________
fire5/expand1x1 (Conv2D)        (None, 36, 36, 128)  4224        activation_11[0][0]              
__________________________________________________________________________________________________
fire5/expand3x3 (Conv2D)        (None, 36, 36, 128)  36992       activation_11[0][0]              
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 36, 36, 128)  0           fire5/expand1x1[0][0]            
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 36, 36, 128)  0           fire5/expand3x3[0][0]            
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 36, 36, 256)  0           activation_12[0][0]              
                                                                 activation_13[0][0]              
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 17, 17, 256)  0           concatenate_4[0][0]              
__________________________________________________________________________________________________
fire6/squeeze (Conv2D)          (None, 17, 17, 48)   12336       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 17, 17, 48)   0           fire6/squeeze[0][0]              
__________________________________________________________________________________________________
fire6/expand1x1 (Conv2D)        (None, 17, 17, 192)  9408        activation_14[0][0]              
__________________________________________________________________________________________________
fire6/expand3x3 (Conv2D)        (None, 17, 17, 192)  83136       activation_14[0][0]              
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 17, 17, 192)  0           fire6/expand1x1[0][0]            
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 17, 17, 192)  0           fire6/expand3x3[0][0]            
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 17, 17, 384)  0           activation_15[0][0]              
                                                                 activation_16[0][0]              
__________________________________________________________________________________________________
fire7/squeeze (Conv2D)          (None, 17, 17, 48)   18480       concatenate_5[0][0]              
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 17, 17, 48)   0           fire7/squeeze[0][0]              
__________________________________________________________________________________________________
fire7/expand1x1 (Conv2D)        (None, 17, 17, 192)  9408        activation_17[0][0]              
__________________________________________________________________________________________________
fire7/expand3x3 (Conv2D)        (None, 17, 17, 192)  83136       activation_17[0][0]              
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 17, 17, 192)  0           fire7/expand1x1[0][0]            
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 17, 17, 192)  0           fire7/expand3x3[0][0]            
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 17, 17, 384)  0           activation_18[0][0]              
                                                                 activation_19[0][0]              
__________________________________________________________________________________________________
fire8/squeeze (Conv2D)          (None, 17, 17, 64)   24640       concatenate_6[0][0]              
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 17, 17, 64)   0           fire8/squeeze[0][0]              
__________________________________________________________________________________________________
fire8/expand1x1 (Conv2D)        (None, 17, 17, 256)  16640       activation_20[0][0]              
__________________________________________________________________________________________________
fire8/expand3x3 (Conv2D)        (None, 17, 17, 256)  147712      activation_20[0][0]              
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 17, 17, 256)  0           fire8/expand1x1[0][0]            
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 17, 17, 256)  0           fire8/expand3x3[0][0]            
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 17, 17, 512)  0           activation_21[0][0]              
                                                                 activation_22[0][0]              
__________________________________________________________________________________________________
fire9/squeeze (Conv2D)          (None, 17, 17, 64)   32832       concatenate_7[0][0]              
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 17, 17, 64)   0           fire9/squeeze[0][0]              
__________________________________________________________________________________________________
fire9/expand1x1 (Conv2D)        (None, 17, 17, 256)  16640       activation_23[0][0]              
__________________________________________________________________________________________________
fire9/expand3x3 (Conv2D)        (None, 17, 17, 256)  147712      activation_23[0][0]              
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 17, 17, 256)  0           fire9/expand1x1[0][0]            
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 17, 17, 256)  0           fire9/expand3x3[0][0]            
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 17, 17, 512)  0           activation_24[0][0]              
                                                                 activation_25[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 17, 17, 512)  0           concatenate_8[0][0]              
__________________________________________________________________________________________________
conv10 (Conv2D)                 (None, 17, 17, 256)  131328      dropout_1[0][0]                  
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 17, 17, 256)  0           conv10[0][0]                     
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 256)          0           activation_26[0][0]              
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 256)          0           global_average_pooling2d_1[0][0] 
==================================================================================================
Total params: 853,824
Trainable params: 131,328
Non-trainable params: 722,496
__________________________________________________________________________________________________
None
